Revit 2024 API
AreaBasedLoadBoundaryLineData Class
 Wrapper class used to access area based load boundary line related data.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class AreaBasedLoadBoundaryLineData : IDisposable
Visual Basic
Public Class AreaBasedLoadBoundaryLineData _
	Implements IDisposable
Visual C++
public ref class AreaBasedLoadBoundaryLineData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData
See Also
AreaBasedLoadBoundaryLineData Members
Autodesk.Revit.DB.Electrical Namespace